trade_exp/src/InformationRegisters/ЗакреплениеКлиентов/ЗакреплениеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0e77b5a2-ffa9-469f-8693-cf5f83743f8f">
  <name>ЗакреплениеКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="016d8cf2-2bd8-4c62-a595-6427befaca23">
    <name>ЗакрепленныйПользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a852551b-5f10-4583-88ca-64a746a35055">
    <name>ПодразделениеПользователя</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c39f0659-84f9-49e5-9004-f80bdfc49e85">
    <name>ОтделПользователя</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ad6cdbc0-bc6b-4b09-a441-35a987ed5cd6">
    <name>НаправлениеПользователя</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="94edd240-af27-4031-9351-2e7b3e87c55b">
    <name>АвторИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="82d795e6-9d78-4b69-9b3a-e934f4b7a424">
    <name>ДатаИВремяЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="00b4fd94-63a4-4608-99b5-26b490cf64f6">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4b1217dd-66ee-48e0-89e6-d61338c76c40">
    <name>ВидМенеджераКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЗакреплениеКлиентов/Forms/ФормаСписка/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекДата = ТекущаяДата();
	ДатаНачала = ТекДата;
	ДатаОкончания = ТекДата; 	
	ОбновитьСписок();  
	УстановитьПраваНаИзменения();
	
КонецПроцедуры

Процедура УстановитьПраваНаИзменения()
	
	ПолныеПрава = РольДоступна("ПолныеПрава");
	ПравоНаИзменение = ПолныеПрава Или РольДоступна("ОтделЛогистики");

КонецПроцедуры	 

#КонецОбласти

#Область ДинамическийСписок

&НаСервере
Процедура ОбновитьСписок()
	
	Закрепление.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДатаНачала));
	Закрепление.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ДатаОкончания));	
	
КонецПроцедуры	

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ОбновитьСписок();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияСРегистром

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ИзменитьЗаписьРегистра();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗакрепление(Команда)

	ИзменитьЗаписьРегистра();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗаписьРегистра()
	
	ВозможностьДействия = ВозможностьДействийСРегистром();
	Если Не ВозможностьДействия.Результат Тогда
		Сообщить(ВозможностьДействия.Сообщение);
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущиеДанные <> Неопределено Тогда

		СтруктураЗаписи = Новый Структура("Период, Клиент, ВидМенеджераКлиента", 
			ТекущиеДанные.НачалоЗакрепления, ТекущиеДанные.Клиент, ТекущиеДанные.ВидМенеджераКлиента);

		МассивСтруктураЗаписи = Новый Массив;
		МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
		КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.ЗакреплениеКлиентов", МассивСтруктураЗаписи);
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыЗаписи", ЭтотОбъект, Новый Структура("ТекущаяСтрока", ТекущаяСтрока));
                              
		Параметрыформы = Новый Структура("Ключ", КлючЗаписи);                            
		ОткрытьФорму("РегистрСведений.ЗакреплениеКлиентов.ФормаЗаписи", Параметрыформы, ЭтотОбъект, , , , Оповещение);
    КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗакрытияФормыЗаписи(ВыбранноеЗначение, ПараметрыОповещения) Экспорт
	
	Элементы.Список.Обновить();
	Элементы.Список.ВыделенныеСтроки.Очистить();
	Элементы.Список.ВыделенныеСтроки.Добавить(ПараметрыОповещения.ТекущаяСтрока);
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗакрепление(Команда)
	
	ВозможностьДействия = ВозможностьДействийСРегистром();
	Если Не ВозможностьДействия.Результат Тогда
		Сообщить(ВозможностьДействия.Сообщение);
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	Если ТекущиеДанные <> Неопределено Тогда
		
		СтруктураЗаписи = Новый Структура("Период, Клиент, ВидМенеджераКлиента", 
			ТекущиеДанные.НачалоЗакрепления, ТекущиеДанные.Клиент, ТекущиеДанные.ВидМенеджераКлиента);
		
  		Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияУдаленияЗаписи", ЭтотОбъект, СтруктураЗаписи);	
 
	    ПоказатьВопрос(Оповещение, СтрШаблон("Удалить закрепление на клиента %1 на %2?",
				ТекущиеДанные.Клиент, Формат(ТекущиеДанные.НачалоЗакрепления, "ДФ=дд.ММ.гггг")),
	    	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет, "Удалить закрепление");   		

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияУдаленияЗаписи(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда      
		УдалитьЗаписьРегистра(Параметры);
		ПослеЗакрытияФормыЗаписи(Неопределено, Новый Структура("ТекущаяСтрока", Элементы.Список.ТекущаяСтрока))
    КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьРегистра(ЗаписьРегистра)
	
	НаборЗаписей = РегистрыСведений.ЗакреплениеКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ЗаписьРегистра.Период);
	НаборЗаписей.Отбор.Клиент.Установить(ЗаписьРегистра.Клиент);
	НаборЗаписей.Отбор.ВидМенеджераКлиента.Установить(ЗаписьРегистра.ВидМенеджераКлиента);
	НаборЗаписей.Записать();
	
КонецПроцедуры		

&НаКлиенте
Функция ВозможностьДействийСРегистром()
	
	РезультатВыполнения = Новый Структура("Результат, Сообщение", Истина, "");
	
	Если Не	ПравоНаИзменение Тогда
		РезультатВыполнения.Результат = Ложь;
		РезультатВыполнения.Сообщение = "Отсутствуют права на изменение закрепления";
	КонецЕсли;
	
	Если Не ПолныеПрава Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		Если ТекущиеДанные.НачалоЗакрепления < ТекущаяДата() Тогда
			РезультатВыполнения.Результат = Ложь;
			РезультатВыполнения.Сообщение = "Действия с закреплением невозможно для прошедших дат";
		КонецЕсли; 
		
	КонецЕсли;		
	
	Возврат РезультатВыполнения;
	
КонецФункции	

#КонецОбласти
